week_6/day_5/cats99/app/controllers/cats_controller.rb

  def index

    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]